---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.ExtrusionAxes
source: html/f1660802-08da-5b67-3919-1f963b769613.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.ExtrusionAxes Property

The extrusion axes to try when doing the calculation.

## Syntax (C#)
```csharp
public IFCExtrusionAxes ExtrusionAxes { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration